//******************************************************************************
// Company:      Johnson Controls Inc.
// -----------------------------------------------------------------------------
// Copyright:    This software is JCI property.
//               Duplication or disclosure without JCI written authorization
//               is prohibited.
// -----------------------------------------------------------------------------
// Project:      X90_BCM
// Language:     ANSI-C
// -----------------------------------------------------------------------------
// Component:    LAP_DLK
//               Doorlock
// -----------------------------------------------------------------------------
// $Date:   Mar 09 2010 10:01:46  $
// $Archive:   J:/_PVCSRoot/Renault/X90_BCM/SOFTWARE/PVCS/archives/DEVELOPMENT/X90_BCM/K0/L7/CMP/LAP/DLK/LAP_DLK.c-arc  $
// $Revision:   1.64  $
// -----------------------------------------------------------------------------
// $Log::   J:/_PVCSRoot/Renault/X90_BCM/SOFTWARE/PVCS/archives/DEVELOPMENT/X90_BCM/K0/L7/CMP/LAP/DLK/LAP_DLK.c-arc  $
// 
//    Rev 1.64   Mar 09 2010 10:01:46   adzhelp
// Cm007644: Code review corrections
// 
//    Rev 1.63   Mar 09 2010 09:54:18   adzhelp
// Cm007644: No HWP in sleep mode for Doorlock LED
// 
//    Rev 1.62   Mar 04 2010 12:29:30   adzhelp
// Cm007632: CDL failure management on rising ignition.
// Button authorization / enabling management updated.
// 

      (u8EEP_TPS_OUVPORTEOld = mDATRead(U8Bit, NEEP_TPS_OUVPORTE, Default)))) // step 1000ms according to CLR53

#define cMotorActivationTimeOut             \
( (tTOSTempo) (10U*  \
    (u8EEP_TPS_COM_MOTEUROld = mDATRead(U8Bit, NEEP_TPS_COM_MOTEUR, Default))) ) //unit:10ms
#define cAutoRelockTimeOut                  \
( (tTOSTempo) (1000U* \
    (u8EEP_TIMER_RECONDA_AUTOOld = mDATRead(U8Bit, NEEP_TIMER_RECONDA_AUTO, Default))) ) //unit:1sec


#define cLedActivationTimeOut  ((tTOSTempo)  60000U) //1min

#define cSevereAbuseTimeOutShort \
    (tTOSTempo)(500U * (u8EEP_TPS_REFShort = mDATRead(U8Bit, NEEP_TPS_REF, Default)))
#define cSevereAbuseTimeOutLong  \
    (tTOSTempo)(2 * (500U * (u8EEP_TPS_REFLong = mDATRead(U8Bit, NEEP_TPS_REF, Default))))

// Protection constant
#define cMaxU8                      ((U8) 0xFFU)
#define cImmoEcmTemporization       (mTOSConvMsInTimerTick((U32)50UL)) // 50ms
#define cEcmTemporization           (mTOSConvMsInTimerTick((U32)10UL)) // 10ms

//--------------------------------------------------------------------------
// Local macros
//
// #define mMacroName   (MacroDefinition)
//--------------------------------------------------------------------------

#define mSet(Type,DataName)                                       \
(DLK ## Type ## Status.BitField.## DataName = cTrue)

#define mReset(Type,DataName)                                     \
(DLK ## Type ## Status.BitField.## DataName = cFalse)

#define mRead(Type,DataName)                                      \
(DLK ## Type ## Status.BitField.## DataName)

#define mReadMotorActivationTimeoutTicks() \
    (MotorActivationTimeoutTicks = \
        (u8EEP_TPS_COM_MOTEUROld == mDATRead(U8Bit, NEEP_TPS_COM_MOTEUR, Default)) ? \
           MotorActivationTimeoutTicks \
        :  mTOSConvMsInTimerTick(cMotorActivationTimeOut))

#define mReadAutoRelockTimeOutTicks() \
    (AutoRelockTimeOutTicks = \
        (u8EEP_TIMER_RECONDA_AUTOOld == mDATRead(U8Bit, NEEP_TIMER_RECONDA_AUTO, Default)) ? \
           AutoRelockTimeOutTicks \
        :  mTOSConvMsInTimerTick(cAutoRelockTimeOut))

#define mReadSevereAbuseTimeOutShortTicks() \
    (SevereAbuseTimeOutShortTicks = \
        (u8EEP_TPS_REFShort == mDATRead(U8Bit, NEEP_TPS_REF, Default) ) ? \
           SevereAbuseTimeOutShortTicks \
        :  mTOSConvMsInTimerTick(cSevereAbuseTimeOutShort) )

#define mReadSevereAbuseTimeOutLongTicks() \
    (SevereAbuseTimeOutLongTicks = \
        (u8EEP_TPS_REFLong == mDATRead(U8Bit, NEEP_TPS_REF, Default) ) ? \
           SevereAbuseTimeOutLongTicks \
        :  mTOSConvMsInTimerTick(cSevereAbuseTimeOutLong) )

#define mReadSDOTimeOutTicks() \
    (SDOTimeOutTicks = \
        (u8EEP_TPS_OUVPORTEOld == mDATRead(U8Bit, NEEP_TPS_OUVPORTE, Default)) ? \
          SDOTimeOutTicks \
        : mTOSConvMsInTimerTick(cSDOTimeOut) )

//--------------------------------------------------------------------------
// Local types
//
//  struct  sStructureName { ... };
//  union   uUnionName { ... };
//  enum    eEnumerationName { ... };
//  typedef Expression tTypeName;
//--------------------------------------------------------------------------

typedef union DLKControlUnion
{
    U32 DLKControlFlags;
    struct
    {
        U1 AllDoorsAreClosed                :1;       // 1
        U1 KeyIsAuthenticated               :1;       // 2
        U1 MotorsAreInOperation             :1;       // 3
        U1 LWSNewConfirmationRequested      :1;       // 4 
        U1 CDLButtonIsAuthorized            :1;       // 5 
        U1 NewCommandToBeDone               :1;       // 6 
        U1 CDLDebounceTimerIsLock           :1;       // 7 
        U1 AutoRelockIsEnabled              :1;       // 8 
        U1 CDLButtonIsPressed               :1;       // 9
        U1 CDLButtonIsLock                  :1;       // 10
        U1 Rising_DOOR_UNLOCK_LOCK_SW       :1;       // 11
        U1 Rising_DOOR_LOCK_SW              :1;       // 12
        U1 Falling_FR_DOORS_SW_LAP_DLK      :1;       // 13
        U1 Falling_RR_DOORS_SW_LAP_DLK      :1;       // 14
        U1 LWSMustLockOverThreshold         :1;       // 15
        U1 LWSLockedWithOpenDoor            :1;       // 16
        U1 AirBagMalFunctionDetected        :1;       // 17
        U1 LWSForbiddenByAirBagMalFunction  :1;       // 18
        U1 LWSWithOpenDoorEnabled           :1;       // 19
        U1 Rising_PWR_IGN_LAP_DLK           :1;       // 20
        U1 Changing_FR_DOORS_SW_LAP_DLK     :1;       // 21
        U1 Changing_RR_DOORS_SW_LAP_DLK     :1;       // 22
        U1 Rising_FR_DOORS_SW_LAP_DLK       :1;       // 23
        U1 LWSSpeedConditionsAreMet         :1;       // 24
        U1 WaitLongSevereAbuseTimeOut       :1;       // 25
        U1 LastRFActionIsUnlock             :1;       // 26  
        U1 LWSForbiddenAfterCrash           :1;       // 27  
        U1 CarSecure                        :1;       // 28  
        U1 SafetyUnlockAllowed              :1;       // 29  
        U1 CDLButtonIsEnabled               :1;       // 30
    } BitField;
} structDLKControlFlag;

typedef union DLKTimerControlUnion
{
    U8 DLKTimerControlFlags;
    struct
    {
        U1 AutoRelockTimerIsArmed           :1;       // 1
        U1 VehiculeHasBeenMovingTimerIsArmed:1;       // 2
        U1 CDLDebounceTimerIsStarted        :1;       // 3 
        U1 LWSActivationTimerIsStarted      :1;       // 4 
        U1 LWSDeativationTimerIsStarted     :1;       // 5 
        U1 LockWithSpeedTimerIsArmed        :1;       // 6
        U1 LedActivationTimerIsStarted      :1;       // 7
        U1 AbuseTimerIsStarted              :1;       // 8
        U1 SDOTimerIsStarted                :1;       // 9
    } BitField;

} structDLKTimerControlFlag;


//Same position as constants to define commands, posible values of: CommandRequest
typedef union DLKArbitrationUnion
{
    U8 DLKArbitrationFlags;
    struct
    {
